docs/markov_chains.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 19:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#discrete-time-markov-chains">1. Discrete-Time Markov Chains</a></li>
<li><a href="#representing-a-discrete-time-markov-chain">2. Representing A Discrete-Time Markov Chain</a></li>
<li><a href="#steady-state-distribution-of-a-discrete-time-markov-chain">3. Steady-State Distribution of a Discrete-Time Markov Chain</a>
<ul>
<li><a href="#calculating-steady-state-probabilities">3.1. Calculating Steady-State Probabilities</a></li>
<li><a href="#markov-chain-ergodicity-conditions">3.2. Markov Chain Ergodicity Conditions</a></li>
</ul>
</li>
<li><a href="#orgf8b9363">4. irreducible</a></li>
<li><a href="#org7e9ad4a">5. aperiodic</a></li>
<li><a href="#org2099f37">6. positive recurrent</a></li>
</ul>
</div>
</div>
<div id="outline-container-discrete-time-markov-chains" class="outline-2">
<h2 id="discrete-time-markov-chains"><span class="section-number-2">1.</span> Discrete-Time Markov Chains</h2>
<div class="outline-text-2" id="text-discrete-time-markov-chains">
<p>
Variables: * Process: evolves over time * Random: Not perfectly
predictable * Discrete-time: Possible changes at periods * State: A
possible value for \(X_n\)
</p>

<pre class="example" id="orgff9b39b">
Definition: Markov Chain: The future is independent of the past, given the present. In other words,

$$
    P(X_{n+1} = j | X_n = i)\; \text{depends only on } i \text{ and } j
$$
</pre>
</div>
</div>

<div id="outline-container-representing-a-discrete-time-markov-chain" class="outline-2">
<h2 id="representing-a-discrete-time-markov-chain"><span class="section-number-2">2.</span> Representing A Discrete-Time Markov Chain</h2>
<div class="outline-text-2" id="text-representing-a-discrete-time-markov-chain">
<p>
Ingredients of a discrete-time Markov chain are: * Current State (order
them) * Transition possibilities (matrix represents \(P_{ij}\) that
represents the transition probabilities) * Rows sum up to 1
</p>
</div>
</div>

<div id="outline-container-steady-state-distribution-of-a-discrete-time-markov-chain" class="outline-2">
<h2 id="steady-state-distribution-of-a-discrete-time-markov-chain"><span class="section-number-2">3.</span> Steady-State Distribution of a Discrete-Time Markov Chain</h2>
<div class="outline-text-2" id="text-steady-state-distribution-of-a-discrete-time-markov-chain">
<p>
Under certain mild conditions, called ergodicity conditions, the state
probabilities converge to values that do not depend on the initial state
probabilities. <i>A necessary condition for this to occur is that we must
be able to reach any other state with positive probability</i>.
</p>
</div>

<div id="outline-container-calculating-steady-state-probabilities" class="outline-3">
<h3 id="calculating-steady-state-probabilities"><span class="section-number-3">3.1.</span> Calculating Steady-State Probabilities</h3>
<div class="outline-text-3" id="text-calculating-steady-state-probabilities">
<p>
The probability of entering node \(i\) should be the same as the
probability exiting node \(i\), this is represented by the following
equation:
</p>

<p>
\[
    \pi_i \sum_{i \neq j} P_{ij} = \sum_{j\neq i} \pi_j P_{ji}
\]
</p>

<p>
This also applies to subsets of the transition diagram.
</p>
</div>
</div>

<div id="outline-container-markov-chain-ergodicity-conditions" class="outline-3">
<h3 id="markov-chain-ergodicity-conditions"><span class="section-number-3">3.2.</span> Markov Chain Ergodicity Conditions</h3>
<div class="outline-text-3" id="text-markov-chain-ergodicity-conditions">
<p>
#+begin<sub>example</sub>
Necessary and sufficient condition: For a discrete Markov chain \(X\), starting from any initial state or distribution, the probabilities \([\pi_1(n), \pi_2(n), ...]\) converge to a unique positive vector \(\pi = [\pi_1, \pi_2,...]\) iff the chain is
</p>
</div>
</div>
</div>

<div id="outline-container-orgf8b9363" class="outline-2">
<h2 id="orgf8b9363"><span class="section-number-2">4.</span> irreducible</h2>
</div>
<div id="outline-container-org7e9ad4a" class="outline-2">
<h2 id="org7e9ad4a"><span class="section-number-2">5.</span> aperiodic</h2>
</div>
<div id="outline-container-org2099f37" class="outline-2">
<h2 id="org2099f37"><span class="section-number-2">6.</span> positive recurrent</h2>
<div class="outline-text-2" id="text-6">
<p>
#+end<sub>example</sub>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-02-14 Tue 19:36</p>
</div>
</body>
</html>
